#include <iostream>

int main() {
    setlocale(LC_ALL, "Russian");
    std::string TENS[20] = {"ноль","один","два","три","четыре","пять","шесть","семь","восемь","девять","десять","одиннадцать",
        "двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать"};
    std::string TENS2[8] = {"двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"};
    std::string HUNDREDS[10] = {"","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот"};
    int N;
    std::cin >> N;
    if (N == 1000000000) {
        std::cout << "один миллиард";
        N = 0;
    }
    int X = N / 1000000;
    if (X / 100 != 0) {
            std::cout << HUNDREDS[X / 100];
    }
    if ((X % 100 < 20) && (X % 100 >= 10)) {
        std::cout << TENS[X % 100];
    }
    else {

    }
}
